exl002/NXP_code/kinetis_bootloader/src/bootloader/src/bl_main.c
#ifndef NEVER_APP_JUMP
    if(RFSYS->REG[0] != 0x01){
        NXP_LOG_INFO("line %d\n", __LINE__);
        configure_clocks(kClockOption_EnterBootloader);
    }

#endif

    NXP_LOG_INFO("line %d\n", __LINE__);

    // Start the lifetime counter
    microseconds_init();
    NXP_LOG_INFO("line %d\n", __LINE__);

#if BL_FEATURE_BYPASS_WATCHDOG
    g_bootloaderContext.flashDriverInterface->flash_register_callback(&g_bootloaderContext.flashState,
                                                                      bootloader_watchdog_service);
    NXP_LOG_INFO("line %d\n", __LINE__);
    bootloader_watchdog_init();
    NXP_LOG_INFO("line %d\n", __LINE__);
#endif // BL_FEATURE_BYPASS_WATCHDOG

    // Init address range of flash array, SRAM_L and SRAM U.
    g_bootloaderContext.memoryInterface->init();
    NXP_LOG_INFO("line %d\n", __LINE__);

    // Fully init the property store.
    g_bootloaderContext.propertyInterface->init();
    NXP_LOG_INFO("line %d\n", __LINE__);

#if BL_FEATURE_RELIABLE_UPDATE
    bootloader_reliable_update_as_requested(kReliableUpdateOption_Normal, 0);
    NXP_LOG_INFO("line %d\n", __LINE__);
#endif // BL_FEATURE_RELIABLE_UPDATE

    // Message so python instantiated debugger can tell the
    // bootloader application is running on the target.
    debug_printf("\r\n\r\nRunning bootloader...\r\n");
    NXP_LOG_INFO("line %d\n", __LINE__);

#if DEBUG && !DEBUG_PRINT_DISABLE
    standard_version_t version = g_bootloaderContext.propertyInterface->store->bootloaderVersion;
    debug_printf("Bootloader version %c%d.%d.%d\r\n", version.name, version.major, version.minor, version.bugfix);
    NXP_LOG_INFO("line %d\n", __LINE__);
#endif

    // Wait for a peripheral to become active.
    g_bootloaderContext.activePeripheral = get_active_peripheral();
    assert(g_bootloaderContext.activePeripheral);

    // Validate required active peripheral interfaces.
    assert(g_bootloaderContext.activePeripheral->controlInterface);

    // Init the active peripheral.
    if (g_bootloaderContext.activePeripheral->byteInterface &&
        g_bootloaderContext.activePeripheral->byteInterface->init)
    {
        g_bootloaderContext.activePeripheral->byteInterface->init(g_bootloaderContext.activePeripheral);
    NXP_LOG_INFO("line %d\n", __LINE__);
    }
    if (g_bootloaderContext.activePeripheral->packetInterface &&
        g_bootloaderContext.activePeripheral->packetInterface->init)
    {
        g_bootloaderContext.activePeripheral->packetInterface->init(g_bootloaderContext.activePeripheral);
    NXP_LOG_INFO("line %d\n", __LINE__);
    }
    NXP_LOG_INFO("line %d\n", __LINE__);

    // Initialize the command processor component.
    g_bootloaderContext.commandInterface->init();
    NXP_LOG_INFO("line %d\n", __LINE__);
}

//! @brief Bootloader outer loop.
//!
//! Infinitely calls the command interface and active peripheral control interface pump routines.
static void bootloader_run(void)
{
    const peripheral_descriptor_t *activePeripheral = g_bootloaderContext.activePeripheral;

    assert(g_bootloaderContext.commandInterface->pump);

    // Read and execute commands.
    while (1)
    {
        g_bootloaderContext.commandInterface->pump();

        // Pump the active peripheral.
        if (activePeripheral->controlInterface->pump)
        {
            activePeripheral->controlInterface->pump(activePeripheral);
        }
    }
}

//! @brief Entry point for the bootloader.
int main(void)
{
#ifdef NXP_PRINT_ON
    SEGGER_RTT_Init();
#endif
    NXP_LOG_INFO("JUMP ADDR: 0x%4X\n", BL_APP_VECTOR_TABLE_ADDRESS);
    NXP_LOG_INFO("RFSYS->REG[0] = %d\n", RFSYS->REG[0]);
#ifdef NXP_PRINT_ON
    #ifdef NEVER_APP_JUMP
        NXP_LOG_INFO("UPPER BL\n");
    #else
        NXP_LOG_INFO("LOWER BL\n");
    #endif
#endif
    bootloader_init();
    bootloader_run();

    // Should never end up here.
    debug_printf("Warning: reached end of main()\r\n");
    return 0;
}

//! Since we never exit this gets rid of the C standard functions that cause
//! extra ROM size usage.
void exit(int arg)
{
}

#if defined(__CC_ARM)
#define ITM_Port8(n) (*((volatile unsigned char *)(0xE0000000 + 4 * n)))
#define ITM_Port16(n) (*((volatile unsigned short *)(0xE0000000 + 4 * n)))
#define ITM_Port32(n) (*((volatile unsigned long *)(0xE0000000 + 4 * n)))

#define DEMCR (*((volatile unsigned long *)(0xE000EDFC)))
#define TRCENA 0x01000000

struct __FILE
{
    int handle; /* Add whatever needed */
};
FILE __stdout;
FILE __stdin;

int fputc(int ch, FILE *f)
{
    if (DEMCR & TRCENA)
    {
        while (ITM_Port32(0) == 0)
            ;
        ITM_Port8(0) = ch;
    }
    return (ch);
}
#endif

//! @}

////////////////////////////////////////////////////////////////////////////////
// EOF
////////////////////////////////////////////////////////////////////////////////
